[
  { "id": 1, "text": "Every cycle is a new beginning. Embrace your rhythm and bloom with confidence!" },
  { "id": 2, "text": "You are strong, resilient, and beautifully in tune with your body." },
  { "id": 3, "text": "Your journey is unique—honor your flow and celebrate your strength." },
  { "id": 4, "text": "Each new cycle is a chance to care for yourself and grow." },
  { "id": 5, "text": "You are more powerful than you know. Trust your inner rhythm." },
  { "id": 6, "text": "Self-care is not selfish. Take time to rest and recharge." },
  { "id": 7, "text": "Your body is wise and wonderful. Listen to its gentle signals." },
  { "id": 8, "text": "Celebrate your cycles—they are a sign of your vitality and health." },
  { "id": 9, "text": "You are blooming, even on the days you feel quiet and still." },
  { "id": 10, "text": "Honor your needs and give yourself kindness every day." },
  { "id": 11, "text": "Your strength shines brightest when you care for yourself." },
  { "id": 12, "text": "Every phase is beautiful. Embrace each moment of your journey." },
  { "id": 13, "text": "You are in harmony with nature—move with your own rhythm." },
  { "id": 14, "text": "Rest is productive. Allow yourself to pause and renew." },
  { "id": 15, "text": "You are radiant, resilient, and worthy of gentle care." },
  { "id": 16, "text": "Your cycle is a reminder of your body’s amazing abilities." },
  { "id": 17, "text": "Nourish your mind, body, and spirit with compassion." },
  { "id": 18, "text": "You are enough, just as you are, every single day." },
  { "id": 19, "text": "Let your cycle inspire you to slow down and reflect." },
  { "id": 20, "text": "You are a force of nature—move with confidence and grace." },
  { "id": 21, "text": "Your well-being matters. Prioritize yourself today." },
  { "id": 22, "text": "Every day is a fresh start. Celebrate your progress." },
  { "id": 23, "text": "You are beautifully cyclical—embrace your natural flow." },
  { "id": 24, "text": "Gentle moments of rest help you bloom even brighter." },
  { "id": 25, "text": "Your journey is valid. Trust your body and your feelings." },
  { "id": 26, "text": "You are worthy of love, care, and understanding." },
  { "id": 27, "text": "Listen to your body’s wisdom and honor its needs." },
  { "id": 28, "text": "You are growing stronger with every cycle you complete." },
  { "id": 29, "text": "Your cycle is a story of resilience and renewal." },
  { "id": 30, "text": "Shine with self-love and let your confidence grow." },
  { "id": 31, "text": "Your cycle is a gentle reminder to honor your needs and rest." },
  { "id": 32, "text": "You are beautifully unique—embrace your journey with pride." },
  { "id": 33, "text": "Let each new day bring you hope, strength, and self-love." },
  { "id": 34, "text": "Your body’s wisdom is a gift—listen and nurture yourself." },
  { "id": 35, "text": "Every phase brings new growth. Celebrate your resilience." },
  { "id": 36, "text": "You are worthy of care, comfort, and gentle encouragement." },
  { "id": 37, "text": "Let your inner light shine, even on your quietest days." },
  { "id": 38, "text": "Your journey is powerful—move forward with confidence." },
  { "id": 39, "text": "Rest, reflect, and renew—your well-being comes first." },
  { "id": 40, "text": "You are a beautiful work in progress. Trust your path." },
  { "id": 41, "text": "Each cycle is a chapter in your story of strength." },
  { "id": 42, "text": "You are enough, just as you are, every single moment." },
  { "id": 43, "text": "Let your cycle inspire you to care deeply for yourself." },
  { "id": 44, "text": "You are a force of nature—move with grace and courage." },
  { "id": 45, "text": "Your body is amazing. Celebrate its rhythm and power." },
  { "id": 46, "text": "Gentle self-care helps you bloom through every season." },
  { "id": 47, "text": "You are resilient, radiant, and worthy of kindness." },
  { "id": 48, "text": "Honor your feelings and trust your body’s gentle cues." },
  { "id": 49, "text": "Your journey is valid—embrace your natural flow." },
  { "id": 50, "text": "You are strong, wise, and beautifully cyclical." },
  { "id": 51, "text": "Let your heart be gentle with yourself today." },
  { "id": 52, "text": "Your cycle is a sign of your body’s strength and grace." },
  { "id": 53, "text": "You are growing, learning, and thriving every day." },
  { "id": 54, "text": "Rest is a gift you give yourself—embrace it fully." },
  { "id": 55, "text": "You are a masterpiece, evolving with every cycle." },
  { "id": 56, "text": "Let your self-care be a daily act of self-love." },
  { "id": 57, "text": "You are worthy of peace, comfort, and understanding." },
  { "id": 58, "text": "Your cycle is a journey—walk it with pride and care." },
  { "id": 59, "text": "You are beautifully resilient—shine in your own way." },
  { "id": 60, "text": "Let your confidence grow with every new beginning." }
]
